Revit 2024 API
BuiltInFailures.WallFailures.WallNegativeHeight Property
 The top of the Wall is lower than the base of the Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WallNegativeHeight { get; }
Visual Basic
Public Shared ReadOnly Property WallNegativeHeight As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WallNegativeHeight {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace